# DATA CLEANING

In [1]:
# Import files

In [4]:
import pandas as pd

In [5]:
pwd

'C:\\Users\\hp\\OneDrive\\CLEAR\\3.A.PANDAS'

In [6]:
df = pd.read_csv('nba.csv')

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       457 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [67]:
df.isnull().sum()

Name        0
Team        1
Number      1
Position    1
Age         0
Height      1
Weight      1
College     0
Salary      0
dtype: int64

In [13]:
df.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,NaN

In [14]:
df.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
454,Raul Neto,Utah Jazz,25.0,PG,24.0,06-Jan,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,07-Mar,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

# INTENDATION

In [17]:
df[['Name']]

(457, 1)

In [19]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [21]:
df[['Team','Position']].head(3)

             Team Position
0  Boston Celtics       PG
1  Boston Celtics       SF
2  Boston Celtics       SG

In [27]:
newdf = df[['Number', 'Height', 'Salary']]

In [28]:
newdf.head(3)

   Number  Height     Salary
0     0.0  06-Feb  7730337.0
1    99.0  06-Jun  6796117.0
2    30.0  06-May        NaN

In [35]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          0
Height       1
Weight       1
College     85
Salary       0
dtype: int64

In [32]:
df['Salary'] = df['Salary'].fillna(0)

In [34]:
df[['Age']] = df[['Age']].fillna(0)

In [36]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [39]:
df['College'] = df['College'].fillna("No COllege")

In [40]:
df.isnull().sum()

Name        1
Team        1
Number      1
Position    1
Age         0
Height      1
Weight      1
College     0
Salary      0
dtype: int64

In [42]:
df.isnull().sum()

Name        1
Team        1
Number      1
Position    1
Age         0
Height      1
Weight      1
College     0
Salary      0
dtype: int64

In [43]:
df.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,06-May,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,06-Oct,231.0,No COllege,5000000.0

In [44]:
df['Name']=df['Name'].fillna("No Name")

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       457 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [48]:
new_df = df.dropna()

In [49]:
new_df.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [50]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [57]:
df.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,30.0,06-Feb,180.0,Texas,7730342.0
1,Jae Crowder,Boston Celtics,99.0,SF,30.0,06-Jun,235.0,Marquette,6796122.0
2,John Holland,Boston Celtics,30.0,SG,32.0,06-May,205.0,Boston University,5.0

In [58]:
df['Age'] = df['Age'].add(5)

In [63]:
df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,150.0,06-Feb,180.0,Texas,7730342.0
1,Jae Crowder,Boston Celtics,99.0,SF,150.0,06-Jun,235.0,Marquette,6796122.0
2,John Holland,Boston Celtics,30.0,SG,160.0,06-May,205.0,Boston University,5.0
3,R.J. Hunter,Boston Celtics,28.0,SG,135.0,06-May,185.0,Georgia State,1148645.0

In [61]:
df['Age'] = df['Age'].sub(5)

In [62]:
df['Age'] = df['Age'].mul(5)

In [64]:
df[['Age']] = df[['Age']].fillna(0)

In [65]:
df[['Weight']] = df[['Weight']].add(20)

In [68]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

ValueError: Length mismatch: Expected axis has 10 elements, new values have 9 elements